{
  "title": "Insights from Data with BigQuery: Challenge Lab",
  "sections": [
    {
      "title": "overview",
      "blocks": [
        {
          "__typename": "Paragraph",
          "text": "You must complete a series of tasks within the allocated time period. Instead of following step-by-step instructions, you'll be given a scenario and a set of tasks - you figure out how to complete it on your own! An automated scoring system (shown on this page) will provide feedback on whether you have completed your tasks correctly."
        },
        {
          "__typename": "Paragraph",
          "text": "To score 100% you must complete all tasks within the time period!"
        },
        {
          "__typename": "Paragraph",
          "text": "When you take a Challenge Lab, you will not be taught Google Cloud concepts. To build the solution to the challenge presented, use skills learned from the labs in the quest this challenge lab is part of. You will be expected to extend your learned skills; you will be expected to change broken queries."
        },
        {
          "__typename": "Paragraph",
          "text": "This lab is recommended for students who have enrolled in the Insights from Data with BigQuery quest. Are you ready for the challenge?",
          "inlineUrls": [
            {
              "url": "https://google.qwiklabs.com/quests/123",
              "position": { "start": 1, "end": 2 }
            }
          ]
        }
      ]
    },
    {
      "title": "Scenario",
      "blocks": [
        {
          "__typename": "Paragraph",
          "text": "You're part of a public health organization which is tasked with identifying answers to queries related to the Covid-19 pandemic. Obtaining the right answers will help the organization in planning and focusing healthcare efforts and awareness programs appropriately."
        },
        {
          "__typename": "Paragraph",
          "text": "The dataset and table that will be used for this analysis will be : bigquery-public-data.covid19_open_data.covid19_open_data. This repository contains country-level datasets of daily time-series data related to COVID-19 globally. It includes data relating to demographics, economy, epidemiology, geography, health, hospitalizations, mobility, government response, and weather.",
          "inlineCodePositions": [
            {
              "position": { "start": 1, "end": 2 }
            }
          ]
        }
      ]
    },
    {
      "title": "Setup and Requirements",
      "blocks": [
        {
          "__typename": "Subtitle",
          "text": "Before you click the Start Lab button"
        },
        {
          "__typename": "Paragraph",
          "text": "Read these instructions. Labs are timed and you cannot pause them. The timer, which starts when you click Start Lab, shows how long Google Cloud resources will be made available to you.",
          "boldTextPositions": [
            {
              "start": 1,
              "end": 2
            }
          ]
        },
        {
          "__typename": "Subtitle",
          "text": "What you need"
        },
        {
          "__typename": "Paragraph",
          "text": "To complete this lab, you need:"
        },
        {
          "__typename": "ItemizedList",
          "items": [
            {
              "text": "Access to a standard internet browser (Chrome browser recommended)."
            },
            {
              "text": "Time to complete the lab."
            }
          ]
        },
        {
          "__typename": "Paragraph",
          "text": "Note: If you already have your own personal Google Cloud account or project, do not use it for this lab."
        },
        {
          "__typename": "Paragraph",
          "text": "Note: If you are using a Pixelbook, open an Incognito window to run this lab."
        },
        {
          "__typename": "Paragraph",
          "text": "How to start your lab and sign in to the Google Cloud Console"
        }
      ]
    }
  ]
}
